using System.Collections;
using System.Collections.Generic;

//フォーメーション
public enum formType
{
    F4_4_2,   // 4-4-2 フラット
    F4_4_1_1,   // 4-4-2 ボックス
    F4_3_1_2,   // 4-4-2 ダイヤモンド
    F4_1_3_2,   // 4-4-2 ダイヤモンド
    F4_2_2_2,   // 4-4-2 ダイヤモンド
    F4_3_3,   // 4-4-2 ダイヤモンド
    F4_3_2_1,   // 4-4-2 ダイヤモンド
    F4_2_2_3,   // 4-4-2 ダイヤモンド
    F4_5_1,     // 4-5-1
    F4_2_3_1,     // 4-5-1
    F4_1_4_1,     // 4-5-1
    F3_5_2_2,  // 2-5-3 1ボランチ
    F3_5_1_1,  // 2-5-3 2ボランチ
    F3_4_1_2,  // 2-5-3 3ボランチ
    F3_4_3,  // 2-5-3 3ボランチ
    F3_4_2_1,  // 2-5-3 3ボランチ
    F3_3_1_3,  // 2-5-3 3ボランチ
    F5_3_2,     // 5-3-2
    F5_3_1_1,   // 2-5-3
    F5_4_1      // 5-4-1
}


public static class posCtl
{
    
    public static void getPosList()
    {
        
    }

}
